Autodesk.Revit.DB.FabricationHostedInfo.PlaceOnHost(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double)
Places the part on the specified host.
Remarks:
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
hostId:
Id of the host fabrication part.
hostConnector:
The connector of the host.
distance:
The distance from the connector to place the hosted part. Units are in feet (ft).
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication part host. The host should be a straight fabrication part.
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016